#+STARTUP: folded indent inlineimages latexpreview
#+PROPERTY: header-args:R :results output :cache yes :session *R:blog* :width 640 :height 480
#+OPTIONS: author:nil H:9 toc:nil
#+HUGO_BASE_DIR: ~/Dropbox/repos/github/five-dots/blog
#+HUGO_SECTION: post/2019/11/

#+TITLE: 1つの org ファイルから Hugo と Qiita の Markdown を生成する
#+DATE: 2019-11-05
#+HUGO_CATEGORIES: emacs
#+HUGO_TAGS: org-mode markdown hugo
#+HUGO_CUSTOM_FRONT_MATTER: :toc true

普段、技術的なメモは Emacs の [[https://orgmode.org/ja/][org-mode]] で書いたものを [[https://github.com/five-dots/notes][自身の github リポジトリ]] に公開している。ただ、これはあくまで個人的なメモなので、それほど他人が見ることを意識したものではない。より見やすい記事として公開するために、個人のブログを、[[https://gohugo.io/][Hugo]] + [[https://www.netlify.com/][Netlify]] で開始したが、同時に力を入れて書いた技術記事は Qiita にも公開して、広く読んでもらえるようにしたい。

そこで、これまで通り、org ファイルは 1 つのリポジトリで管理しつつ、個人ブログ向けと Qiita 向けの Markdown をエクスポートできないか試してみた。

なお、Hugo テーマは [[https://github.com/olOwOlo/hugo-theme-even][even]] を利用している。その他のテーマでは、この記事と異なる結果になる可能性もあるので、その点は注意が必要だ。

** Emacs Lisp

#+begin_src emacs-lisp :exports both
(emacs-version)
#+end_src

#+RESULTS:
: GNU Emacs 26.3 (build 2, x86_64-pc-linux-gnu, GTK+ Version 3.22.30)
:  of 2019-09-17

*** Code output

#+begin_src R :exports both
R.version
#+end_src

#+RESULTS:
#+begin_example
               _                           
platform       x86_64-pc-linux-gnu         
arch           x86_64                      
os             linux-gnu                   
system         x86_64, linux-gnu           
status                                     
major          3                           
minor          6.1                         
year           2019                        
month          07                          
day            05                          
svn rev        76782                       
language       R                           
version.string R version 3.6.1 (2019-07-05)
nickname       Action of the Toes
#+end_example

*** Table

#+begin_src R :results value :colnames yes :exports both
library(tidyverse)
head(iris)
#+end_src

#+RESULTS:
| Sepal.Length | Sepal.Width | Petal.Length | Petal.Width | Species |
|--------------+-------------+--------------+-------------+---------|
|          5.1 |         3.5 |          1.4 |         0.2 | setosa  |
|          4.9 |           3 |          1.4 |         0.2 | setosa  |
|          4.7 |         3.2 |          1.3 |         0.2 | setosa  |
|          4.6 |         3.1 |          1.5 |         0.2 | setosa  |
|            5 |         3.6 |          1.4 |         0.2 | setosa  |
|          5.4 |         3.9 |          1.7 |         0.4 | setosa  |

** Python

#+begin_src python :session :exports both
import sys
sys.version
#+end_src

#+RESULTS:
: 3.6.8 (default, Oct  7 2019, 12:59:55) 
: [GCC 8.3.0]

